Modules/Booking/app/Livewire/Pages/BookingForm.php

insert into "bookings" ("pelanggan_id", "ukuran", "desain_custom_url", "tgl_ambil", "status_verifikasi", "updated_at", "created_at") values (1, '1', null, '2026-05-19 00:00:00', 'pending', '2026-05-18 04:19:07', '2026-05-18 04:19:07')
---
    public function submit(): void
    {
        $this->validate();

        $url = null;
        if ($this->desain_custom) {
            $url = $this->desain_custom->store('desain', 'public');
        }

        // $pelangganId = Auth::user()->pelanggan->id;
		// Jika pelanggan belum ada, buat baru, hanya untuk testing (data dummy)
		$user = Auth::user();
        $pelanggan = $user->pelanggan;
        if (!$pelanggan) {
            $pelanggan = Pelanggan::create([
                'user_id' => $user->id,
            ]);
        }
        $pelangganId = $pelanggan->id;

        Booking::create([
            'pelanggan_id'      => $pelangganId,
            'ukuran'            => $this->ukuran,
            'desain_custom_url' => $url,
            'tgl_ambil'         => $this->tgl_ambil,
            'status_verifikasi' => 'pending',
        ]);