Modules/Ulasan/app/Livewire/UlasanForm.php

select * from "produks" order by "nama_produk" asc
---
    public function mount(?int $product_id = null): void
	{
	    $this->products = Produk::orderBy('nama_produk')->get();

insert into "ulasans" ("pelanggan_id", "produk_id", "rating", "komentar", "is_visible", "updated_at", "created_at") values (1, 2, 3, 'Menurut saya kue red velvet nya rasanya bolehlah, ngga enak banget dan ngga buruk juga', 1, '2026-05-19 03:38:23', '2026-05-19 03:38:23')
---
    public function submit(): void
    {
        $this->validate();

        $user = Auth::user();
        $pelanggan = $user->pelanggan;
        if (!$pelanggan) {
            $pelanggan = Pelanggan::create([
                'user_id' => $user->id,
            ]);
        }

        $review = Ulasan::create([
            'pelanggan_id' => $pelanggan->id,
            'produk_id' => $this->produk_id,
            'rating' => $this->rating,
            'komentar' => $this->komentar,
            'is_visible' => true,
        ]);

select * from "pelanggans" where "pelanggans"."id" in (1)
select * from "ulasans" where "produk_id" = 2 and "is_visible" = 1 order by "created_at" desc limit 10
select * from "users" where "users"."id" in (26)
---
    protected function loadReviews(): void
    {
        if (!$this->produk_id) {
            $this->existingReviews = collect();
            return;
        }

        $this->existingReviews = Ulasan::with(['pelanggan.user'])
            ->where('produk_id', $this->produk_id)
            ->where('is_visible', true)
            ->latest()
            ->limit(10)
            ->get();

select avg("rating") as aggregate from "ulasans" where "ulasans"."produk_id" = 2 and "ulasans"."produk_id" is not null and "is_visible" = 1
update "produks" set "rating_rata_rata" = 3, "updated_at" = '2026-05-19 03:38:23' where "id" = 2
---
    protected function updateProductRating(Produk $produk): void
    {
        $average = (float) $produk->ulasans()
            ->where('is_visible', true)
            ->avg('rating');

        $produk->update(['rating_rata_rata' => $average]);